1

In [1]:
import pandas as pd
data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
      'Age': [24, 27, 22, 32, 29],
      'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
      'Salary': [45000, 54000, 50000, 62000, 47000]
  }
df = pd.DataFrame.from_dict(data)
df.head(5)

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

Explanation:
- dataframe is created from given dictionary and first n rows are displayed using head function

In [2]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

Explanation:
- pandas describe function gives statistical details for numeric columns

In [3]:
hr_avg_salary = df[df['Department'] == 'HR']['Salary'].mean()
print(f"The average salary in HR is: {hr_avg_salary}")

The average salary in HR is: 46000.0

Explanation:
- dataframe is subset for department equals to HR and for the salary column, mean is computed

2

In [4]:
df["Bonus"] = 0.1*df["Salary"]

Explanation:
- a column bonus is created considering 10% of salary

In [5]:
df.head()

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

3

In [6]:
df[(df['Age']<30) & (df['Age']>25) ]

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

Explanation:
- subset is created for age between 25 and 30

4

In [7]:
avg_salary_per_dept = df.groupby('Department')['Salary'].mean()
print(avg_salary_per_dept)

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

Explanation:
- df is grouped by department and mean of salary is computed

In [8]:
df.sort_values(by=['Age'], ascending=True, inplace=True)
df.to_csv("Srted.csv")

Explanation:
- df is sorted by age in ascending order
- saved into a csv file